;Place localized text in this file

[MetionBattleSuit X2ArmorTemplate]
FriendlyName="Metion Battlesuit"
FriendlyNamePlural="Metion Battlesuits"
BriefSummary="This experimental battlesuit grants massive damage resistance, survivability, as well as a large assortment of weapon systems. The Metion Battlesuit can also deploy a shield that serves as temporary cover for allies."
TacticalText="<Bullet/> The Metion Battlesuit is equipped with rockets, a magnetic minigun, close range destroyer gauntlet, a hardpoint for heavy weapons and a jetpack system for quick repositioning.\n<Bullet/> The Metion Battlesuit can deploy a shield, allowing the wearer to temporarily act as high cover for squadmates."

[MetionClusterRocket X2AbilityTemplate]
LocFriendlyName="Metion Rocket Barrage"
LocLongDescription="Bombard a wide area with a barrage of rockets"
LocHelpText="Bombard a wide area with a barrage of rockets"
LocFlyOverText="Rocket Barrage"

[MetionShield X2AbilityTemplate]
LocFriendlyName="Metion Shield"
LocLongDescription="Deploy a shield granting cover to allies, decreases defense to the user, but increases Armor and Dodge"
LocHelpText="Deploys a shield"
LocFlyOverText="Metion Shield"

[MetionGauntlet X2AbilityTemplate]
LocFriendlyName="Prototype Plasma Bolt Launcher"
LocLongDescription="Fires an extremely powerful plasma bolt at melee range"
LocHelpText="Fire Gauntlet"
LocFlyOverText="Metion Gauntlet"

[MagneticMiniGun X2AbilityTemplate]
LocFriendlyName="Akontia pattern Magnetic Minigun"
LocLongDescription="Fires a rain of magnetic bolts over a wide area"
LocHelpText="Fire Magnetic Minigun"
LocFlyOverText="Magnetic Minigun"

[MetionJump X2AbilityTemplate]
LocFriendlyName="Metion Jetpack"
LocLongDescription="The large thrusters built onto the Metion Battlesuit allows the user to quickly reposition on the battlefield"
LocHelpText="Fly to a new location"
LocFlyOverText="Metion Jetpack"

[MetionKnee X2AbilityTemplate]
LocFriendlyName="Rocket Knee Strike"
LocLongDescription="Utilize the thrusters built into the calves of the Battlesuit to deal a quick disorienting knee strike"
LocHelpText="Disorients target"
LocFlyOverText="Metion Knee Strike"

[MetionTech X2TechTemplate]
DisplayName="Experimental Battlesuit"
Summary="Commander, as the technology the aliens utilize against us increases in lethality, it has become evident that we need to quickly research countermeasures in both survivability and lethality."
CodeName="Enneapylon"
LongDescription="Commander, we have designed an experimental battlesuit which won't only increase the survivability of the soldier wearing it, but is also equipped with a large variety of heavy weaponry, and a jetpack which should allow the user to reposition in the battlefield a limited number of times in order to make up for how heavy and unwieldy the battlesuit is. \n\n While the \"Metion\"  Battlesuit is an improvement over our W.A.R. Suits in terms of protection, it is the technology powering its rocket and gauntlet weapon that makes it a success in our continued attempt to improve our fighting chance against the aliens. While the rockets simply use a more sophisticated containment system to carry bigger payloads, the weapon installed on the suit's right arm however is a \"Prototype Plasma Bolt Launcher\", the weapon concentrates a stream of plasma into a single projectile before letting it loose, unfortunately the technology does not allow the projectile to travel far before violently exploding as such while it is only usable in close quarters, it is extremely powerful.  \n\n To make up for the inherent lack of mobility of this battlesuit, it has been equipped with an additional long range weapon, a miniaturized magnetic gatling gun hidden under the deployable shield equipped on the suit's left arm, while not as powerful as a plasma weapon, the smaller power draw of the magnetic weapon allows us to equip the suit with another countermeasure for low mobility, a powerful yet a bit rudimentary \"jetpack\", there is only enough power in the suit to allow the jetpack to be used a couple of times, therefore it is imperative that our troop are careful with its use. \n\n R. Tygan."
AlertString="Experimental Battlesuit"

[MetionBattlesuit X2TechTemplate]
DisplayName="Metion Battlesuit"
Summary="A supremely powerful battlesuit designed by Tygan and the research team, while the suit might be a bit unwieldy i believe it more than makes up for it by carrying a multitude of weapon systems while still being an upgrade over the W.A.R. suit in terms of durability L. Shen." 


[MetionBattlesuitCrabHelm X2BodyPartTemplate]
DisplayName="Metion Crab Helm"

[MetionBattlesuitCrabHelmX X2BodyPartTemplate]
DisplayName="Metion Crab Helm X"

[MetionBattlesuitCrabHelmSkull X2BodyPartTemplate]
DisplayName="Metion Crab Helm Skull"

[MetionBattlesuitCrabHelm_F X2BodyPartTemplate]
DisplayName="Metion Crab Helm"

[MetionBattlesuitCrabHelmX_F X2BodyPartTemplate]
DisplayName="Metion Crab Helm X"

[MetionBattlesuitCrabHelmSkull_F X2BodyPartTemplate]
DisplayName="Metion Crab Helm Skull"

[MetionBrickhead X2BodyPartTemplate]
DisplayName="Metion Brick Head"

[MetionBrickheadSkull X2BodyPartTemplate]
DisplayName="Metion Brick Skull Head"

[MetionCustodianHound X2BodyPartTemplate]
DisplayName="Metion Custodian Hound"

[MetionCustodianHoundKnight X2BodyPartTemplate]
DisplayName="Metion Custodian Knight Hound"

[MetionCustodianHoundSkull X2BodyPartTemplate]
DisplayName="Metion Custodian Hound Skull"

[MetionCustodianHoundWhite X2BodyPartTemplate]
DisplayName="Metion Custodian Hound White"

[MetionCustodianHoundWolfSkull X2BodyPartTemplate]
DisplayName="Metion Custodian Hound Wolf Skull"

[MetionXiphosCrab X2BodyPartTemplate]
DisplayName="Metion Xiphos Crab Helm"

[MetionXiphosCrabCrabPaint X2BodyPartTemplate]
DisplayName="Metion Xiphos Crab Helm Crab Paint"

[MetionXiphosCrabOneEye X2BodyPartTemplate]
DisplayName="Metion Xiphos Crab One Eye"

[MetionXiphosWhite X2BodyPartTemplate]
DisplayName="Metion Xiphos Crab White"

[MetionBrickhead_F X2BodyPartTemplate]
DisplayName="Metion Brick Head"

[MetionBrickheadSkull_F X2BodyPartTemplate]
DisplayName="Metion Brick Skull Head"

[MetionCustodianHound_F X2BodyPartTemplate]
DisplayName="Metion Custodian Hound"

[MetionCustodianHoundKnight_F X2BodyPartTemplate]
DisplayName="Metion Custodian Knight Hound"

[MetionCustodianHoundSkull_F X2BodyPartTemplate]
DisplayName="Metion Custodian Hound Skull"

[MetionCustodianHoundWhite_F X2BodyPartTemplate]
DisplayName="Metion Custodian Hound White"

[MetionCustodianHoundWolfSkull_F X2BodyPartTemplate]
DisplayName="Metion Custodian Hound Wolf Skull"

[MetionXiphosCrab_F X2BodyPartTemplate]
DisplayName="Metion Xiphos Crab Helm"

[MetionXiphosCrabCrabPaint_F X2BodyPartTemplate]
DisplayName="Metion Xiphos Crab Helm Crab Paint"

[MetionXiphosCrabOneEye_F X2BodyPartTemplate]
DisplayName="Metion Xiphos Crab One Eye"

[MetionXiphosWhite_F X2BodyPartTemplate]
DisplayName="Metion Xiphos Crab White"